In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1' : np.random.randn(5),
                   'data2' : np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  1.809734 -0.145345
1    a  two  0.771994  1.046685
2    b  one -1.677893 -1.648777
3    b  two -1.138345 -0.296939
4    a  one  0.868807  0.423750

In [5]:
grouped = df['data1'].groupby(df['key1'])
grouped
grouped.mean()

key1
a    1.150178
b   -1.408119
Name: data1, dtype: float64

In [7]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()
means
means.unstack()

key2       one       two
key1
a     1.339270  0.771994
b    -1.677893 -1.138345

In [8]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])
df['data1'].groupby([states, years]).mean()

California  2005    0.771994
            2006   -1.677893
Ohio        2005    0.335694
            2006    0.868807
Name: data1, dtype: float64

In [12]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one  1.809734 -0.145345
1    a  two  0.771994  1.046685
4    a  one  0.868807  0.423750
b
  key1 key2     data1     data2
2    b  one -1.677893 -1.648777
3    b  two -1.138345 -0.296939

In [13]:
for dtype, group in grouped:
    print(dtype)
    print(group)

a
0    1.809734
1    0.771994
4    0.868807
Name: data1, dtype: float64
b
2   -1.677893
3   -1.138345
Name: data1, dtype: float64

In [14]:
people = pd.DataFrame(np.random.randn(5, 5),
                      columns=['a', 'b', 'c', 'd', 'e'],
                      index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])
people.iloc[2:3, [1, 2]] = np.nan
people

               a         b         c         d         e
Joe     0.022737 -1.194784  0.379180  1.409296 -0.389625
Steve  -0.532058  0.653198  0.176440 -0.391185  0.189234
Wes     0.134121       NaN       NaN  0.086294  0.191040
Jim     0.301051  0.876404  0.298491  0.461233 -1.227815
Travis -1.034231  0.961113 -1.445274  0.287939 -1.361990

In [16]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
           'd': 'blue', 'e': 'red', 'f' : 'orange'}
mapping

{'a': 'red', 'b': 'red', 'c': 'blue', 'd': 'blue', 'e': 'red', 'f': 'orange'}

In [17]:
by_column = people.groupby(mapping, axis=1)
by_column.sum()

            blue       red
Joe     1.788477 -1.561671
Steve  -0.214746  0.310374
Wes     0.086294  0.325162
Jim     0.759724 -0.050360
Travis -1.157335 -1.435107

In [18]:
grouped = df.groupby('key1')
grouped['data1'].quantile(0.9)

key1
a    1.621548
b   -1.192300
Name: data1, dtype: float64

In [19]:
def peak_to_peak(arr):
    return arr.max() - arr.min()
grouped.agg(peak_to_peak)

         data1     data2
key1
a     1.037739  1.192031
b     0.539548  1.351838

In [20]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0  1.150178  0.573239  0.771994  0.820401  0.868807  1.339270
b      2.0 -1.408119  0.381518 -1.677893 -1.543006 -1.408119 -1.273232

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     1.809734   3.0  0.441697  0.596218 -0.145345  0.139202  0.423750
b    -1.138345   2.0 -0.972858  0.955894 -1.648777 -1.310818 -0.972858


           75%       max
key1
a     0.735217  1.046685
b    -0.634899 -0.296939

In [21]:
tips = pd.read_csv('examples/tips.csv')
tips['tip_pct'] = tips['tip'] / tips['total_bill']
tips[:6]

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808
5       25.29  4.71     No  Sun  Dinner     4  0.186240

In [23]:
grouped = tips.groupby(['day', 'smoker'])
grouped_pct = grouped['tip_pct']
grouped_pct.agg('mean')

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [24]:
functions = ['count', 'mean', 'max']
result = grouped['tip_pct', 'total_bill'].agg(functions)
result

            tip_pct                     total_bill
              count      mean       max      count       mean    max
day  smoker
Fri  No           4  0.151650  0.187735          4  18.420000  22.75
     Yes         15  0.174783  0.263480         15  16.813333  40.17
Sat  No          45  0.158048  0.291990         45  19.661778  48.33
     Yes         42  0.147906  0.325733         42  21.276667  50.81
Sun  No          57  0.160113  0.252672         57  20.506667  48.17
     Yes         19  0.187250  0.710345         19  24.120000  45.35
Thur No          45  0.160298  0.266312         45  17.113111  41.19
     Yes         17  0.163863  0.241255         17  19.190588  43.11

In [25]:
s = pd.Series(np.random.randn(6))
s[::2] = np.nan
s

0         NaN
1    0.246049
2         NaN
3    0.830254
4         NaN
5    0.043898
dtype: float64

In [26]:
s.fillna(s.mean())

0    0.373400
1    0.246049
2    0.373400
3    0.830254
4    0.373400
5    0.043898
dtype: float64

In [27]:
states = ['Ohio', 'New York', 'Vermont', 'Florida',
          'Oregon', 'Nevada', 'California', 'Idaho']
group_key = ['East'] * 4 + ['West'] * 4
data = pd.Series(np.random.randn(8), index=states)
data

Ohio          0.495579
New York     -0.518735
Vermont      -1.801926
Florida      -0.068712
Oregon        1.637835
Nevada       -0.968620
California    0.070720
Idaho        -0.598641
dtype: float64

In [28]:
data[['Vermont', 'Nevada', 'Idaho']] = np.nan
data

Ohio          0.495579
New York     -0.518735
Vermont            NaN
Florida      -0.068712
Oregon        1.637835
Nevada             NaN
California    0.070720
Idaho              NaN
dtype: float64

In [29]:
data.groupby(group_key).mean()

East   -0.030623
West    0.854278
dtype: float64